johnerb44/lvgl_esp32_template/sdkconfig.defaults
# This file was generated using idf.py save-defconfig. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF) 5.2.0 Project Minimal Configuration
#
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_RODATA=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_FREERTOS_HZ=1000
CONFIG_ESP32S3_DATA_CACHE_LINE_64B=y

CONFIG_EXAMPLE_LVGL_PORT_TASK_CORE=1
CONFIG_EXAMPLE_LVGL_PORT_AVOID_TEAR_ENABLE=y

# USB Serial/JTAG disabled: USB_SEL=0 routes native USB away from USB-C,
# so the USB S/JTAG peripheral would stall waiting for an absent USB host.
# CH343P (COM3) handles all UART flashing/monitoring instead.
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y

# esptool uses --before no_reset; the on-screen FLASH button in main.c
# calls enter_flash_mode() which holds GPIO0=LOW via rtc_gpio_hold_en()
# through esp_restart(), putting the ROM into UART download mode.
CONFIG_ESPTOOLPY_BEFORE_NORESET=y

CONFIG_LV_COLOR_SCREEN_TRANSP=y
CONFIG_LV_MEM_CUSTOM=y
CONFIG_LV_MEMCPY_MEMSET_STD=y
CONFIG_LV_USE_LOG=y
CONFIG_LV_LOG_PRINTF=y
CONFIG_LV_USE_PERF_MONITOR=y
CONFIG_LV_ATTRIBUTE_FAST_MEM_USE_IRAM=y
CONFIG_LV_FONT_MONTSERRAT_12=y
CONFIG_LV_FONT_MONTSERRAT_16=y
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_24=y
CONFIG_LV_USE_FONT_COMPRESSED=y
CONFIG_LV_USE_IMGFONT=y
CONFIG_LV_USE_DEMO_WIDGETS=y
CONFIG_LV_USE_DEMO_BENCHMARK=y
CONFIG_LV_USE_DEMO_STRESS=y
CONFIG_LV_USE_DEMO_MUSIC=y
CONFIG_LV_DEMO_MUSIC_AUTO_PLAY=y

# Secure Lockbox Feature Flags
CONFIG_LOCKBOX_INTEGRATION_ENABLE=y
CONFIG_LOCKBOX_INTEGRATION_USE_MOCK_DEVICES=n
CONFIG_LOCKBOX_FEATURE_SC16IS752=y
CONFIG_LOCKBOX_FEATURE_R503=y
CONFIG_LOCKBOX_FEATURE_HLK_TX510=y
CONFIG_LOCKBOX_FEATURE_PCA9685=y
CONFIG_LOCKBOX_FEATURE_STATUS_INPUTS=y
CONFIG_LOCKBOX_FEATURE_INA219=y
CONFIG_LOCKBOX_FEATURE_DS3231=y
CONFIG_LOCKBOX_FEATURE_SLEEP_MODE=y
CONFIG_LOCKBOX_SLEEP_INACTIVITY_TIMEOUT_S=300
CONFIG_IDF_TARGET="esp32s3"

# Secure Lockbox Feature Flags
CONFIG_LOCKBOX_FEATURE_SLEEP_MODE=y
